public class Main {
    public static void main(String[] args) {
        AbstractPhone firstPhone = new ThomasEdisonPhone(1879); // створюємо об'єкт типу класу AbstractPhone, але з поведінкою
        // класу ThomasEdisonPhone, якому задаємо аргумент (рік випуску телефону)

        AbstractPhone landlinePhone = new LandlinePhone(1984); // створюємо об'єкт типу класу AbstractPhone, але з поведінкою
        // класу LandlinePhone, якому задаємо аргумент (рік випуску телефону)

        AbstractPhone videoPhone = new VideoPhone(2018); // створюємо об'єкт типу класу AbstractPhone, але з поведінкою
        // класу VideoPhone, якому задаємо аргумент (рік випуску телефону)

        User user = new User("Абонент"); // створюємо нового користувача і в якості аргументу задаємо ім'я - Абонент

        user.callAnotherUser(111222333, firstPhone); // для користувача викликаємо метод - зателефонувати іншому користувачу і
        // як аргументи передаємо номер телефону та телефон, яким буде здійснено дзвінок

        user.callAnotherUser(111222333, landlinePhone); // для користувача викликаємо метод - зателефонувати іншому користувачу і
        // як аргументи передаємо номер телефону та телефон, яким буде здійснено дзвінок

        user.callAnotherUser(111222333, videoPhone); // для користувача викликаємо метод - зателефонувати іншому користувачу і
        // як аргументи передаємо номер телефону та телефон, яким буде здійснено дзвінок
    }
}
